Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_5 (Conv2D)            (None, 32, 32, 32)        896       
_________________________________________________________________
dropout_5 (Dropout)          (None, 32, 32, 32)        0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 32, 32, 32)        9248      
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 32, 16, 16)        0         
_________________________________________________________________
flatten_3 (Flatten)          (None, 8192)              0         
_________________________________________________________________
dense_5 (Dense)              (None, 512)               4194816   
_________________________________________________________________
dropout_6 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_6 (Dense)              (None, 10)                5130      
=================================================================
Total params: 4,210,090.0
Trainable params: 4,210,090.0
Non-trainable params: 0.0
_________________________________________________________________
None
Train on 25000 samples, validate on 10000 samples
Epoch 1/10
25000/25000 [==============================] - 425s - loss: 1.7306 - acc: 0.3638 - val_loss: 1.6284 - val_acc: 0.4068
Epoch 2/10
25000/25000 [==============================] - 420s - loss: 1.5415 - acc: 0.4377 - val_loss: 1.4815 - val_acc: 0.4637
Epoch 3/10
25000/25000 [==============================] - 421s - loss: 1.4362 - acc: 0.4811 - val_loss: 1.4251 - val_acc: 0.4836
Epoch 4/10
25000/25000 [==============================] - 421s - loss: 1.3622 - acc: 0.5074 - val_loss: 1.3386 - val_acc: 0.5161
Epoch 5/10
25000/25000 [==============================] - 421s - loss: 1.3092 - acc: 0.5284 - val_loss: 1.3201 - val_acc: 0.5254
Epoch 6/10
25000/25000 [==============================] - 425s - loss: 1.2594 - acc: 0.5500 - val_loss: 1.3140 - val_acc: 0.5230
Epoch 7/10
25000/25000 [==============================] - 422s - loss: 1.2146 - acc: 0.5664 - val_loss: 1.2786 - val_acc: 0.5410
Epoch 8/10
25000/25000 [==============================] - 438s - loss: 1.1690 - acc: 0.5815 - val_loss: 1.2727 - val_acc: 0.5445
Epoch 9/10
25000/25000 [==============================] - 449s - loss: 1.1427 - acc: 0.5946 - val_loss: 1.2547 - val_acc: 0.5504
Epoch 10/10
25000/25000 [==============================] - 476s - loss: 1.0984 - acc: 0.6041 - val_loss: 1.2466 - val_acc: 0.5532
Accuracy: 55.32%