### 50 smart neurons ###

Layer (type)                 Output Shape              Param #   
=================================================================
embedding_5 (Embedding)      (None, 500, 32)           160000    
_________________________________________________________________
lstm_2 (LSTM)                (None, 50)                16600     
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 51        
=================================================================
Total params: 176,651.0
Trainable params: 176,651
Non-trainable params: 0.0
_________________________________________________________________
None
Epoch 1/3
25000/25000 [==============================] - 390s - loss: 0.5266 - acc: 0.7416      
Epoch 2/3
25000/25000 [==============================] - 417s - loss: 0.2954 - acc: 0.8831     
Epoch 3/3
25000/25000 [==============================] - 399s - loss: 0.2407 - acc: 0.9056     
Accuracy: 87.87%




### 10 smart neurons ###
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_6 (Embedding)      (None, 500, 32)           160000    
_________________________________________________________________
lstm_3 (LSTM)                (None, 10)                1720      
_________________________________________________________________
dense_5 (Dense)              (None, 1)                 11        
=================================================================
Total params: 161,731.0
Trainable params: 161,731
Non-trainable params: 0.0
_________________________________________________________________
None
Epoch 1/3
25000/25000 [==============================] - 417s - loss: 0.4754 - acc: 0.7842      
Epoch 2/3
25000/25000 [==============================] - 451s - loss: 0.3090 - acc: 0.8792     
Epoch 3/3
25000/25000 [==============================] - 461s - loss: 0.2575 - acc: 0.9009     
Accuracy: 87.64%


### 20 smart neurons ###
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_9 (Embedding)      (None, 500, 32)           160000    
_________________________________________________________________
lstm_6 (LSTM)                (None, 20)                4240      
_________________________________________________________________
dense_8 (Dense)              (None, 1)                 21        
=================================================================
Total params: 164,261.0
Trainable params: 164,261
Non-trainable params: 0.0
_________________________________________________________________
None
Epoch 1/3
25000/25000 [==============================] - 405s - loss: 0.4758 - acc: 0.7698      
Epoch 2/3
25000/25000 [==============================] - 426s - loss: 0.2848 - acc: 0.8884     
Epoch 3/3
25000/25000 [==============================] - 20370s - loss: 0.2376 - acc: 0.9080     
Accuracy: 85.82%